Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection.CrossSectionLocation Property
Note: This API is now obsolete.
 Gets or sets a value of the property CrossSectionLocation.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Please use Location instead.")]
public double CrossSectionLocation { get; set; }
<ObsoleteAttribute("Deprecated. Please use Location instead.")>
Public Property CrossSectionLocation As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace